docs/comp-sci/theorem-provers/mizar/subgroup-series.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Subgroup Series - Mizar</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Subgroup Series - Mizar</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-e5583d34-8606-4622-bc9a-3b915cb5eb4a">1. Subgroup Series</a>
<ul>
<li><a href="#h-4ecb1fc1-3d39-4555-8a61-3cf134915242">1.1. Central Series</a></li>
<li><a href="#h-193c557d-a853-468a-a56f-ba3d2dfcf3ba">1.2. Subnormal Series</a></li>
<li><a href="#h-f057b7e7-9fa8-4236-9410-dfac6ff1e4df">1.3. Composition Series</a></li>
<li><a href="#h-7b9e0126-cb6c-4b44-8ae6-245ce59a4467">1.4. Lower Central Series</a></li>
<li><a href="#h-a6f950fd-41bb-4c6c-9e3f-2c3828fdec89">1.5. Upper Central Series</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-h-e5583d34-8606-4622-bc9a-3b915cb5eb4a" class="outline-2">
<h2 id="h-e5583d34-8606-4622-bc9a-3b915cb5eb4a"><span class="section-number-2">1.</span> Subgroup Series</h2>
<div class="outline-text-2" id="text-h-e5583d34-8606-4622-bc9a-3b915cb5eb4a">
<p>
I will review the various subgroup series, and &#x2014; if they've been
already defined (implicitly or explicitly) &#x2014; their implementation.
</p>
</div>

<div id="outline-container-h-4ecb1fc1-3d39-4555-8a61-3cf134915242" class="outline-3">
<h3 id="h-4ecb1fc1-3d39-4555-8a61-3cf134915242"><span class="section-number-3">1.1.</span> Central Series</h3>
<div class="outline-text-3" id="text-h-4ecb1fc1-3d39-4555-8a61-3cf134915242">
<p>
The definition of a nilpotent group uses a central series
\(G=Z_{1}\geq Z_{2}\geq\dots\geq Z_{n}=\mathbf{1}\) where
each \(Z_{k}\trianglelefteq G\) and the quotient satisfies
\(Z_{k}/Z_{k+1}\leq Z(G/Z_{k+1})\).
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-main">definition</span>
  <span class="org-mizar-skeleton">let</span> IT <span class="org-mizar-normal">be</span> Group;
  <span class="org-mizar-normal">attr</span> IT <span class="org-mizar-normal">is</span> nilpotent <span class="org-mizar-normal">means</span> :Def2: <span class="org-comment-delimiter">:: </span><span class="org-comment">GRNILP_1:def 2</span>
  <span class="org-mizar-formula">ex</span> F <span class="org-mizar-formula">being</span> FinSequence <span class="org-mizar-normal">of</span> the_normal_subgroups_of IT <span class="org-mizar-formula">st</span>
  (len F &gt; 0 <span class="org-mizar-formula">&amp;</span> F.1 = (Omega).IT <span class="org-mizar-formula">&amp;</span> F.(len F) = (1).IT <span class="org-mizar-formula">&amp;</span>
   (<span class="org-mizar-formula">for</span> i <span class="org-mizar-formula">being</span> Element <span class="org-mizar-normal">of</span> NAT <span class="org-mizar-formula">st</span> i in dom F <span class="org-mizar-formula">&amp;</span> i+1 in dom F
    <span class="org-mizar-formula">for</span> G1, G2 <span class="org-mizar-formula">being</span> strict normal Subgroup <span class="org-mizar-normal">of</span> IT
    <span class="org-mizar-formula">st</span> G1 = F.i <span class="org-mizar-formula">&amp;</span> G2 = F.(i + 1)
    <span class="org-mizar-formula">holds</span> (G2 <span class="org-mizar-normal">is</span> Subgroup <span class="org-mizar-normal">of</span> G1 <span class="org-mizar-formula">&amp;</span>
           G1./.((G1,G2)`*`) <span class="org-mizar-normal">is</span> Subgroup <span class="org-mizar-normal">of</span>
             center (IT./.G2))));
<span class="org-mizar-block">end</span>; 
</pre>
</div>
</div>
</div>

<div id="outline-container-h-193c557d-a853-468a-a56f-ba3d2dfcf3ba" class="outline-3">
<h3 id="h-193c557d-a853-468a-a56f-ba3d2dfcf3ba"><span class="section-number-3">1.2.</span> Subnormal Series</h3>
<div class="outline-text-3" id="text-h-193c557d-a853-468a-a56f-ba3d2dfcf3ba">
<p>
A solvable group is defined by having a subnormal series
\(G=N_{1}\trianglerighteq N_{2}\trianglerighteq\dots\trianglerighteq N_{n}=\mathbf{1}\)
&#x2014; that is, \(N_{j+1}\trianglelefteq N_{j}\) for \(j=0,\dots,n-1\) &#x2014;
whose factor groups \(N_{k}/N_{k+1}\) are Abelian.
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-main">definition</span>
  <span class="org-mizar-skeleton">let</span> IT <span class="org-mizar-normal">be</span> Group;
  <span class="org-mizar-normal">attr</span> IT <span class="org-mizar-normal">is</span> solvable <span class="org-mizar-normal">means</span> :Def1: <span class="org-comment-delimiter">:: </span><span class="org-comment">GRSOLV_1:def 1</span>
  <span class="org-mizar-formula">ex</span> F <span class="org-mizar-formula">being</span> FinSequence <span class="org-mizar-normal">of</span> Subgroups IT <span class="org-mizar-formula">st</span>
  (len F &gt; 0 <span class="org-mizar-formula">&amp;</span> F.1 = (Omega).IT <span class="org-mizar-formula">&amp;</span> F.(len F) = (1).IT <span class="org-mizar-formula">&amp;</span>
   (<span class="org-mizar-formula">for</span> i <span class="org-mizar-formula">being</span> Element <span class="org-mizar-normal">of</span> NAT <span class="org-mizar-formula">st</span> i in dom F <span class="org-mizar-formula">&amp;</span> i+1 in dom F
    <span class="org-mizar-formula">for</span> G1, G2 <span class="org-mizar-formula">being</span> strict Subgroup <span class="org-mizar-normal">of</span> IT
    <span class="org-mizar-formula">st</span> G1 = F.i <span class="org-mizar-formula">&amp;</span> G2 = F.(i+1)
    <span class="org-mizar-formula">holds</span> (G2 <span class="org-mizar-normal">is</span> strict normal Subgroup <span class="org-mizar-normal">of</span> G1 <span class="org-mizar-formula">&amp;</span>
           (<span class="org-mizar-formula">for</span> N <span class="org-mizar-formula">being</span> normal Subgroup <span class="org-mizar-normal">of</span> G1 <span class="org-mizar-formula">st</span> N = G2
            <span class="org-mizar-formula">holds</span> G1 ./. N <span class="org-mizar-normal">is</span> commutative))));
<span class="org-mizar-block">end</span>; 
</pre>
</div>
</div>
</div>

<div id="outline-container-h-f057b7e7-9fa8-4236-9410-dfac6ff1e4df" class="outline-3">
<h3 id="h-f057b7e7-9fa8-4236-9410-dfac6ff1e4df"><span class="section-number-3">1.3.</span> Composition Series</h3>
<div class="outline-text-3" id="text-h-f057b7e7-9fa8-4236-9410-dfac6ff1e4df">
<p>
A famous example of a subgroup series is the composition
series for a group. Mizar defines it as a subgroup series
\(\mathbf{1}=A_{n}\trianglelefteq\dots\trianglelefteq A_{2}\trianglelefteq A_{1}=G\).
Although this seems to be using a strange convention, Mizar is following
Bourbaki's <i>Algbra</i>. The more familiar notion of a composition
series (as a ``maximal'' subnormal series) requires the
<code>jordan_holder</code> attribute (again, this follows Bourbaki's
<i>Algebra</i> Definition 10 in I.4.7).
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-comment-delimiter">:: </span><span class="org-comment">ALG I.4.7 Definition 9</span>
<span class="org-mizar-main">definition</span>
  <span class="org-mizar-skeleton">let</span> O <span class="org-mizar-normal">be</span> set;
  <span class="org-mizar-skeleton">let</span> G <span class="org-mizar-normal">be</span> GroupWithOperators <span class="org-mizar-normal">of</span> O;
  <span class="org-mizar-skeleton">let</span> IT <span class="org-mizar-normal">be</span> FinSequence <span class="org-mizar-normal">of</span> the_stable_subgroups_of G;
  <span class="org-mizar-normal">attr</span> IT <span class="org-mizar-normal">is</span> composition_series <span class="org-mizar-normal">means</span>
  <span class="org-comment-delimiter">:: </span><span class="org-comment">GROUP_9:def 28</span>
  IT.1=(Omega).G <span class="org-mizar-formula">&amp;</span> IT.(len IT)= (1).G <span class="org-mizar-formula">&amp;</span>
  <span class="org-mizar-formula">for</span> i <span class="org-mizar-formula">being</span> Nat <span class="org-mizar-formula">st</span> i in dom IT <span class="org-mizar-formula">&amp;</span> i+1 in dom IT
  <span class="org-mizar-formula">for</span> H1,H2 <span class="org-mizar-formula">being</span> StableSubgroup <span class="org-mizar-normal">of</span> G
  <span class="org-mizar-formula">st</span> H1=IT.i <span class="org-mizar-formula">&amp;</span> H2=IT.(i+1)
  <span class="org-mizar-formula">holds</span> H2 <span class="org-mizar-normal">is</span> normal StableSubgroup <span class="org-mizar-normal">of</span> H1;
<span class="org-mizar-block">end</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-h-7b9e0126-cb6c-4b44-8ae6-245ce59a4467" class="outline-3">
<h3 id="h-7b9e0126-cb6c-4b44-8ae6-245ce59a4467"><span class="section-number-3">1.4.</span> Lower Central Series</h3>
<div class="outline-text-3" id="text-h-7b9e0126-cb6c-4b44-8ae6-245ce59a4467">
<p>
The lower central series may be defined as
\(G=A_{1}\trianglerighteq A_{2}\trianglerighteq\dots\trianglerighteq A_{n}=\mathbf{1}\),
where \(A_{k+1}=[A_{k},G]=[G,A_{k}]\).
Mizar implicitly defines this in <code>GRNILP1:Th27</code>
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-main">theorem</span> <span class="org-comment-delimiter">:: </span><span class="org-comment">GRNILP_1:27</span>
  <span class="org-mizar-formula">for</span> G <span class="org-mizar-formula">being</span> Group
  <span class="org-mizar-formula">st</span> <span class="org-mizar-formula">ex</span> F <span class="org-mizar-formula">being</span> FinSequence <span class="org-mizar-normal">of</span> the_normal_subgroups_of G
     <span class="org-mizar-formula">st</span> len F &gt; 0 <span class="org-mizar-formula">&amp;</span> F.1 = (Omega).G <span class="org-mizar-formula">&amp;</span> F.(len F) = (1).G <span class="org-mizar-formula">&amp;</span>
     <span class="org-mizar-formula">for</span> i <span class="org-mizar-formula">st</span> i in dom F <span class="org-mizar-formula">&amp;</span> i+1 in dom F
     <span class="org-mizar-formula">for</span> G1 <span class="org-mizar-formula">being</span> strict normal Subgroup <span class="org-mizar-normal">of</span> G <span class="org-mizar-formula">st</span> G1 = F.i
     <span class="org-mizar-formula">holds</span> [.G1, (Omega).G.] = F.(i+1)
  <span class="org-mizar-formula">holds</span> G <span class="org-mizar-normal">is</span> nilpotent
<span class="org-mizar-block">proof</span> <span class="org-mizar-block">end</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-h-a6f950fd-41bb-4c6c-9e3f-2c3828fdec89" class="outline-3">
<h3 id="h-a6f950fd-41bb-4c6c-9e3f-2c3828fdec89"><span class="section-number-3">1.5.</span> Upper Central Series</h3>
<div class="outline-text-3" id="text-h-a6f950fd-41bb-4c6c-9e3f-2c3828fdec89">
<p>
This is a subgroup series
\(Z^0(G) \leq Z^1(G) \leq Z^2(G) \leq \dots\),
where \(Z^{0}(G)=\mathbf{1}\),
\(Z^1(G) = Z(G)\),
\(Z^2(G)/Z^1(G) = Z(G/Z^1(G))\),
\(Z^3(G)/Z^2(G) = Z(G/Z^2(G))\), and so on. Each \(Z^{n}(G)\) is a normal
subgroup of \(G\).
</p>

<p>
In general, \(Z^{n+1}(G)/Z^{n}(G) = Z(G/Z^{n}(G))\) defines the \((n+1)\)
term in the series. Explicitly, we would have
</p>

<p>
\[ Z^{n+1}(G) = \{x\in G\mid \forall y\in G, [x,y]\in Z^{n}(G)\}. \]
</p>

<p>
We could thus propose the definition (based on modifying the definition
<code>GRNILP_1:def 2</code> to use <code>NAT_1</code> for <code>mode sequence of X is Function of NAT,X</code>):
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-main">definition</span>
  <span class="org-mizar-skeleton">let</span> G <span class="org-mizar-normal">be</span> Group;
  <span class="org-mizar-normal">func</span> UpperCentralSeries G -&gt; sequence <span class="org-mizar-normal">of</span> the_normal_subgroups_of G <span class="org-mizar-normal">means</span>
  :Def:
  (<span class="org-mizar-normal">it</span>.0 = (1).G <span class="org-mizar-formula">&amp;</span>
   (<span class="org-mizar-formula">for</span> i <span class="org-mizar-formula">being</span> Element <span class="org-mizar-normal">of</span> NAT <span class="org-mizar-formula">st</span> i in dom <span class="org-mizar-normal">it</span> <span class="org-mizar-formula">&amp;</span> i+1 in dom <span class="org-mizar-normal">it</span>
    <span class="org-mizar-formula">for</span> G1, G2 <span class="org-mizar-formula">being</span> strict normal Subgroup <span class="org-mizar-normal">of</span> G
    <span class="org-mizar-formula">st</span> G1 = <span class="org-mizar-normal">it</span>.i <span class="org-mizar-formula">&amp;</span> G2 = <span class="org-mizar-normal">it</span>.(i + 1)
    <span class="org-mizar-formula">holds</span> (G1 <span class="org-mizar-normal">is</span> Subgroup <span class="org-mizar-normal">of</span> G2 <span class="org-mizar-formula">&amp;</span>
           G2./.((G2,G1)`*`) = center (G./.G1))));
  <span class="org-mizar-normal">existence</span>
  <span class="org-mizar-block">proof</span>
    <span class="org-mizar-skeleton">thus</span> <span class="org-mizar-formula">ex</span> Z <span class="org-mizar-formula">being</span> sequence <span class="org-mizar-normal">of</span> the_normal_subgroups_of G <span class="org-mizar-formula">st</span>
     (Z.0 = (1).G <span class="org-mizar-formula">&amp;</span>
      (<span class="org-mizar-formula">for</span> i <span class="org-mizar-formula">being</span> Element <span class="org-mizar-normal">of</span> NAT <span class="org-mizar-formula">st</span> i in dom Z <span class="org-mizar-formula">&amp;</span> i+1 in dom Z
       <span class="org-mizar-formula">for</span> G1, G2 <span class="org-mizar-formula">being</span> strict normal Subgroup <span class="org-mizar-normal">of</span> G
       <span class="org-mizar-formula">st</span> G1 = Z.i <span class="org-mizar-formula">&amp;</span> G2 = Z.(i + 1)
       <span class="org-mizar-formula">holds</span> (G1 <span class="org-mizar-normal">is</span> Subgroup <span class="org-mizar-normal">of</span> G2 <span class="org-mizar-formula">&amp;</span>
              G2./.((G2,G1)`*`) = center (G./.G1))));
  <span class="org-mizar-block">end</span>;
  <span class="org-mizar-normal">uniqueness</span>
  <span class="org-mizar-block">proof</span>
    <span class="org-mizar-normal">defpred</span> P[sequence <span class="org-mizar-normal">of</span> the_normal_subgroups_of G] <span class="org-mizar-normal">means</span>
    ($1.0 = (1).G <span class="org-mizar-formula">&amp;</span>
      (<span class="org-mizar-formula">for</span> i <span class="org-mizar-formula">being</span> Element <span class="org-mizar-normal">of</span> NAT <span class="org-mizar-formula">st</span> i in dom $1 <span class="org-mizar-formula">&amp;</span> i+1 in dom $1
       <span class="org-mizar-formula">for</span> G1, G2 <span class="org-mizar-formula">being</span> strict normal Subgroup <span class="org-mizar-normal">of</span> G
       <span class="org-mizar-formula">st</span> G1 = $1.i <span class="org-mizar-formula">&amp;</span> G2 = $1.(i + 1)
       <span class="org-mizar-formula">holds</span> (G1 <span class="org-mizar-normal">is</span> Subgroup <span class="org-mizar-normal">of</span> G2 <span class="org-mizar-formula">&amp;</span>
              G2./.((G2,G1)`*`) = center (G./.G1))));
    <span class="org-mizar-formula">for</span> Z1,Z2 <span class="org-mizar-formula">being</span> sequence <span class="org-mizar-normal">of</span> the_normal_subgroups_of G <span class="org-mizar-formula">st</span>
    P[Z1] <span class="org-mizar-formula">&amp;</span> P[Z2] <span class="org-mizar-formula">holds</span> Z1=Z2;
    <span class="org-mizar-skeleton">hence</span> <span class="org-mizar-normal">thesis</span>;
  <span class="org-mizar-block">end</span>;
<span class="org-mizar-block">end</span>;
</pre>
</div>

<p>
We would then have to prove
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-main">theorem</span>
  <span class="org-mizar-formula">for</span> G <span class="org-mizar-normal">be</span> Group
  <span class="org-mizar-formula">for</span> n <span class="org-mizar-normal">be</span> Nat
  <span class="org-mizar-formula">holds</span> the carrier <span class="org-mizar-normal">of</span> (UpperCentralSeries G).(n+1) =
        {g <span class="org-mizar-normal">where</span> g <span class="org-mizar-normal">is</span> Element <span class="org-mizar-normal">of</span> G :
         <span class="org-mizar-formula">for</span> y <span class="org-mizar-formula">being</span> Element <span class="org-mizar-normal">of</span> G
         <span class="org-mizar-formula">holds</span> [.g,y.] in (UpperCentralSeries G).n};
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2022-04-12 Tue 08:27.</p>
</div>
</body>
</html>